{
    "personal_info": {
        "name": "Muhammad Ammar Khan",
        "profile_banner": "https://i.imgur.com/WiI2OZb.png",
        "location": "District Jhelum, Punjab, Pakistan",
        "phone": "+92 314 5401405",
        "date_of_birth": "April 1, 2001",
        "nationality": "Pakistani",
        "taglines": [
            "Software Architect & Security Engineer",
            "C++ Expert & Cryptography Specialist",
            ".NET Engineer at ACE Money Transfer",
            "AI-Powered Innovation Engineer",
            "Creating What Hasn't Been Built Before"
        ],
        "social_links": [
            {
                "platform": "GitHub",
                "username": "@TheMR-777",
                "url": "https://github.com/TheMR-777",
                "badge": {
                    "light": "https://img.shields.io/badge/GitHub-%40TheMR--777-%23E6E6FA?logo=github&style=flat",
                    "dark": "https://img.shields.io/badge/GitHub-%40TheMR--777-%23181717?logo=github&style=flat",
                    "alt": "GitHub Badge"
                }
            },
            {
                "platform": "WhatsApp",
                "username": "+92 314 5401405",
                "url": "https://wa.me/923145401405",
                "badge": {
                    "light": "https://img.shields.io/badge/WhatsApp-%2B92%20314%205401405-%23DFFFD6?logo=whatsapp&style=flat",
                    "dark": "https://img.shields.io/badge/WhatsApp-%2B92%20314%205401405-%23075E54?logo=whatsapp&style=flat",
                    "alt": "WhatsApp Badge"
                }
            },
            {
                "platform": "Email",
                "username": "m.shahzad.ms72@gmail.com",
                "url": "mailto:m.shahzad.ms72@gmail.com",
                "badge": {
                    "light": "https://img.shields.io/badge/Email-m.shahzad.ms72%40gmail.com-%23FFE4E1?logo=gmail&style=flat",
                    "dark": "https://img.shields.io/badge/Email-m.shahzad.ms72%40gmail.com-%23EA4335?logo=gmail&style=flat",
                    "alt": "Email Badge"
                }
            }
        ]
    },
    "personal_statement": "As a lifelong computer enthusiast with an innate drive to innovate and engineer novel solutions, I've cultivated deep expertise in **Cyber Security**, **Ethical Hacking**, **Artificial Intelligence**, and **Game Development** from an early age. My passion for pushing technological boundaries is complemented by advanced skills in modern C++, cryptography, and cutting-edge software engineering practices. Throughout my journey, I've consistently sought to create what hasn't been built before, approaching complex challenges with a systematic engineering mindset. This pioneering approach has enabled me to architect world-class solutions across various domains, always striving for excellence in security, performance, and design.",
    "career_objective": "Seeking challenging opportunities to architect and engineer innovative solutions at the forefront of technology. With expertise in modern C++, system architecture, cryptography, and AI-assisted development, I aim to create impactful software that breaks new ground. My goal is to leverage my diverse technical background in **Artificial Intelligence**, **Cyber Security**, **System Architecture**, and **Performance Engineering** to solve complex problems that others consider impossible, continuing my trajectory of delivering excellence through thoughtfully designed systems and creative problem-solving.",
    "education": [
        {
            "degree": "BS (Honors) in Computer Science",
            "institution": "University of the Punjab, Jhelum Campus",
            "year": "2023",
            "cgpa": "3.73/4.0",
            "key_coursework": [
                {
                    "category": "Computing & Software",
                    "courses": [
                        "Data Structures & Algorithms",
                        "Analysis of Algorithms",
                        "Software Engineering",
                        "Object-Oriented Analysis & Design",
                        "Software Quality Assurance"
                    ]
                },
                {
                    "category": "Systems & Architecture",
                    "courses": [
                        "Operating Systems",
                        "Computer Architecture",
                        "System Programming"
                    ]
                },
                {
                    "category": "Security & Networking",
                    "courses": [
                        "Network Security",
                        "Computer Networks"
                    ]
                },
                {
                    "category": "Mathematics & AI",
                    "courses": [
                        "Artificial Intelligence",
                        "Probability & Statistics",
                        "Linear Algebra"
                    ]
                },
                {
                    "category": "Database Systems",
                    "courses": [
                        "Database Management Systems (DBMS) with Lab"
                    ]
                },
                {
                    "category": "Theory",
                    "courses": [
                        "Theory of Automata & Formal Languages",
                        "Compiler Construction"
                    ]
                }
            ],
            "final_year_project": {
                "title": "Costaz",
                "description": "A Flutter application assisting teachers in managing student records, attendance, marks, and assignments, securely storing data in Google Drive via Google Sheets.",
                "technologies": [
                    "Flutter",
                    "Google Sheets API",
                    "Google Drive API",
                    "Google Authentication API"
                ]
            }
        },
        {
            "degree": "Intermediate in Pre-Engineering",
            "institution": "F.G. Intermediate College, Jhelum Cantt",
            "year": "2019",
            "marks": "743/1100",
            "percentage": "67.5%"
        },
        {
            "degree": "Matriculation",
            "institution": "F.G. Public School, Jhelum Cantt",
            "year": "2017",
            "marks": "845/1050",
            "percentage": "80.5%"
        }
    ],
    "work_experience": [
        {
            "company": "ACE Money Transfer",
            "position": ".NET Developer & Architecture Consultant",
            "duration": "June 2023 - Present",
            "responsibilities": [
                "Architect and engineer mission-critical systems from concept to implementation, including the 'ACE Password Vault' with bespoke security architecture. Provide expert consultancy on security infrastructure, cryptographic implementations, and scalable PWA architecture.",
                "Lead UI/UX design initiatives for enterprise management suites after my innovative designs for the Employee Monitoring Suite gained recognition from executive leadership. Create intuitive, efficient interfaces that balance aesthetic appeal with functional excellence.",
                "Design and develop core components of the Accounts and Treasury Management Systems (AMS/TMS) with a focus on extensibility and scalability. Currently serving as key architectural consultant for the company's enterprise ERP initiative, implementing a simplicity-driven approach to complex system design.",
                "Engineer the Primary Control Center for the ERP system, featuring sophisticated multi-level approval workflows and comprehensive administrative tools that elegantly solve complex business process challenges through standardized interfaces and reliable architecture.",
                "Engineer advanced cryptographic solutions and security measures using C++ and .NET, implementing multi-layered encryption systems (RSA, AES, HMAC) for sensitive financial data and partner APIs.",
                "Modernize legacy systems through strategic technical migrations to .NET 8/9 and AvaloniaUI, introducing GraphQL APIs to enhance developer experience and system performance."
            ],
            "achievements": [  
                "Engineered the 'ACE Password Vault' from the ground up, delivering a sophisticated security solution that became a critical company asset with world-class protection mechanisms.",
                "Revolutionized the company's approach to UI/UX design through innovative, user-centric interfaces that significantly improved efficiency and user satisfaction across multiple enterprise applications.",
                "Received direct commendation from the CTO for architectural innovations and engineering excellence that solved previously intractable technical challenges.",
                "Transformed the scope of the company's ERP project by architecting a multi-tenant solution capable of serving the entire ACE Group of Companies rather than just a single business unit, significantly increasing the system's value and potential ROI.",
                "Enhanced system security for a major banking partner through a custom-designed two-layer encryption system that exceeded industry standards.",
                "Transformed team productivity by engineering an Employee Monitoring Suite that overcame complex OS-level challenges to deliver reliable, high-performance monitoring while maintaining code quality and architectural integrity.",
                "Established reputation as a key technical innovator, earning a role as architecture consultant on the company's strategic ERP initiative."
            ]
        },
        {
            "company": "TeqHolic",
            "position": "Intern",
            "duration": "3 Months",
            "responsibilities": [
                "Developed frontend applications using Flutter and Firebase",
                "Built **Chirp**, a social media application similar to Twitter",
                "Developed **Sara Kuch**, an e-commerce application using Shopify REST API"
            ]
        }
    ],
    "skills": {
        "programming": [
            "C++ (expert, including C++23/26)",
            "C# (advanced)",
            "Python (intermediate)",
            "MATLAB (scientific computing)",
            "Dart (proficient)",
            "JavaScript (intermediate)",
            "TypeScript (intermediate)"
        ],
        "engineering_and_architecture": [
            "System Architecture Design",
            "Scalable & SaaS-first Architecture",
            "Extensible Software Design",
            "Performance Optimization",
            "Low-level Systems Programming",
            "Technical Problem Solving"
        ],
        "ui_ux_design": [
            "Material 3",
            "Fluent 2 Design System",
            "Minimalist & User-Centric Design",
            "Wireframing & Prototyping"
        ],
        "cpp_expertise": [
            "Modern C++ Paradigms",
            "Template Metaprogramming",
            "SFINAE & Concepts",
            "STL Implementation",
            "Multithreading & Concurrency",
            "Memory Management",
            "Performance Optimization"
        ],
        "cryptography_and_security": [
            "Cryptographic System Design",
            "Security Architecture",
            "Advanced Encryption (AES, RSA, ECC)",
            "Key Generation & Management",
            "HMAC & Authentication Systems",
            "OpenSSL API Integration",
            "mr_crypt Library Development",
            "Ethical Hacking",
            "Penetration Testing",
            "Mobile Security Engineering"
        ],
        "artificial_intelligence": [
            "AI-Assisted Development",
            "Advanced Prompt Engineering",
            "Machine Learning Integration",
            "Neural Network Implementation",
            "AI as Engineering Accelerator"
        ],
        "scientific_computing": [
            "Quantum Computing Simulation",
            "Signal Processing",
            "Indoor Positioning Systems",
            "MATLAB",
            "Scientific Visualization",
            "Computational Physics",
            "NumPy",
            "SciPy",
            "Matplotlib"
        ],
        "game_development": [
            "Game Engine Architecture",
            "Performance Optimization for Games",
            "Game Systems Design"
        ],
        "frameworks": [
            ".NET Framework & Core (through .NET 9)",
            "AvaloniaUI (UI Framework)",
            "Blazor (Web Framework)",
            "Angular (Web Framework)",
            "PrimeNG (UI Component Library)",
            "Flutter (Cross-platform Framework)",
            "Qt C++ (Native Framework)",
            "Firebase (Backend Services)",
            "Google Cloud APIs",
            "GraphQL (API Framework)"
        ],
        "paradigms": [
            "Data-Oriented Design",
            "Object-Oriented Programming",
            "Functional Programming & Monadic Patterns",
            "Template Metaprogramming",
            "Aspect-Oriented Programming",
            "Component-Based Architecture",
            "Microservices Architecture",
            "Event-Driven Architecture"
        ],
        "apis": [
            "REST",
            "SOAP",
            "GraphQL"
        ],
        "database_management": [
            "MySQL (with EAV Design)",
            "Microsoft SQL Server",
            "SQLite",
            "Redis (Caching)",
            "Stored Procedures"
        ],
        "architecture_patterns": [
            "Entity-Attribute-Value Model",
            "Unit of Work Pattern",
            "Repository Pattern",
            "Approval Workflow Systems",
            "Multi-tenancy Architecture",
            "Simplicity-Driven Design"
        ],
        "tools_and_platforms": [
            "Visual Studio",
            "IntelliJ IDEA",
            "VS Code",
            "Git & GitHub",
            "Google Colab & Jupyter Notebook",
            "Jira",
            "Linux",
            "Windows",
            "macOS"
        ],
        "ai_and_problem_solving": [
            "Advanced Google Search Operators",
            "AI-assisted development (harnessing GPTs, Claude, LLaMA, Command R+, GitHub Copilot, Microsoft Copilot, Mixtral AI, Google's Gemini)",
            "AI Prompt Engineering"
        ]
    },
    "projects": [
        {
            "title": "UWB Indoor Positioning & Localization Simulation System",
            "role": "Lead Developer & System Architect",
            "technologies": [
                "C# 13",
                ".NET 9",
                "WPF",
                "Python 3.13",
                "Signal Processing",
                "Heatmap Visualization",
                "Computational Geometry",
                "NumPy",
                "SciPy",
                "Matplotlib"
            ],
            "description": "Single-handedly designed and implemented a sophisticated Ultra-Wideband (UWB) simulation system for MIMOS Berhad from December 2024 to July 2025. The system enables precise indoor positioning simulation through an intuitive interface where users can upload building floorplans, strategically place anchor points, generate real-time heatmaps visualizing signal coverage, density over time and distance, signal intersections, and localize objects in the room. Engineered a complex obstacle management system capable of modeling various materials with different attenuation factors and geometries, accurately calculating and visualizing their effects on signal propagation.",
            "impact": "Delivered a high-precision simulation tool that exceeded client expectations, receiving specific praise for exceptional attention to detail and accuracy. The system enables MIMOS Berhad to optimize UWB deployments without costly physical testing, significantly reducing implementation time and costs while improving positioning accuracy in complex indoor environments."
        },
        {
            "title": "Enterprise Resource Planning (ERP) System",
            "role": "Architecture Consultant & UI/UX Engineer",
            "technologies": [
                "Angular 20",
                "PrimeNG",
                "C# 13",
                ".NET 9",
                "MySQL with EAV Design",
                "GraphQL",
                "Redis",
                "Unit of Work Pattern",
                "Stored Procedures",
                "Multi-tenant Architecture"
            ],
            "description": "Contributing to the architecture and design of a comprehensive ERP system built with scalability and flexibility as core principles. Led the transformation of a single-company solution into a multi-company platform capable of serving the entire ACE Group of Companies and potentially other enterprise groups. Engineered the Primary Control Center for administrators, featuring a sophisticated multi-level approval workflow system that elegantly handles complex business processes through a standardized, reliable interface. Meticulously designed the Admin Tools module, implementing user management, privilege controls, role-based access systems, and multi-company enterprise management capabilities.",
            "impact": "Transformed the project scope from a single-company tool to a true enterprise-grade ERP system capable of supporting diverse business units across multiple companies. Established architectural patterns that significantly reduced development complexity while enhancing system flexibility. The PrimeNG component recommendation was widely adopted and praised by the lead developer for its elegance and efficiency. The approval workflow system has become a cornerstone of the application, enabling standardized business processes across the organization."
        },
        {
            "title": "Employee Monitoring Suite",
            "role": "Lead Developer & System Architect",
            "technologies": [
                "C# 13",
                ".NET 9",
                "AvaloniaUI",
                "Blazor",
                "GraphQL API",
                "Micro-ORM",
                "ApexCharts",
                "Microsoft SQL Server"
            ],
            "description": "Engineered a sophisticated monitoring system that overcame significant OS-level challenges to deliver reliable, high-performance tracking of employee activities. Designed the architecture to handle complex concurrency issues, system-level interactions, and real-time data processing while maintaining exceptional performance. The suite's innovative design balances comprehensive monitoring capabilities with an elegant, intuitive interface that received executive-level recognition for its excellence.",
            "impact": "Transformed team productivity by 200% and reduced unauthorized breaks by 35% through intelligent system design. The project's technical sophistication and elegant architecture established my reputation as both a skilled engineer and innovative designer within the organization."
        },
        {
            "title": "ACE Password Vault",
            "role": "Lead Architect & Security Engineer",
            "technologies": [
                ".NET",
                "C++",
                "Blazor (PWA)",
                "Modern Cryptography",
                "Custom Security Protocols"
            ],
            "description": "Designed and engineered a sophisticated password management system with a security-first architecture that implements multiple layers of protection beyond industry standards. Developed custom cryptographic protocols and innovative security mechanisms to safeguard critical company credentials while maintaining exceptional usability.",
            "impact": "Created a security solution that became a critical infrastructure component for the company, establishing new internal standards for secure application development and demonstrating my ability to engineer robust security systems from first principles."
        },
        {
            "title": "mr_crypt",
            "role": "Creator & Principal Engineer",
            "technologies": [
                "C++23",
                "OpenSSL 3.0+ API",
                "Template Metaprogramming"
            ],
            "description": "Engineered a modern C++ cryptography library that reimagines how developers interact with cryptographic primitives. Designed with an innovative range-like syntax that dramatically simplifies implementation while maintaining security integrity. The library leverages advanced C++ features and template metaprogramming to provide an intuitive yet powerful interface to OpenSSL's C API.",
            "impact": "Revolutionized cryptographic implementation workflows for developers by reducing development time by approximately 10x while significantly improving code readability and maintaining rigorous security standards."
        },
        {
            "title": "Mobile Security Research and Publications",
            "role": "Cyber Security Researcher and Pioneer",
            "technologies": [
                "Android OS",
                "Security Analysis Tools",
                "Custom Penetration Testing Scripts",
                "Mobile-to-Mobile Security Framework"
            ],
            "description": "Pioneered innovative approaches to mobile security research in 2018, driven by a passion to explore the boundaries of what's possible in software security. Developed groundbreaking methods for conducting security assessments using only mobile devices when traditional computing resources were unavailable—a challenge many considered impossible. This work demonstrated my ability to engineer creative solutions to complex technical problems by reimagining conventional security testing paradigms.",
            "publications": "Authored highly influential educational articles on **Null Byte** that gained significant recognition in the cyber security community, with one becoming the second most-read article on the platform from 2018-2020 (details in the Publications section)."
        },
        {
            "title": "Costaz (Final Year Project)",
            "role": "Lead Developer & System Architect",
            "technologies": [
                "Flutter",
                "Google Sheets API",
                "Google Drive API",
                "Google Authentication API",
                "Custom Data Synchronization System"
            ],
            "description": "Developed a student records management system after surveying 10+ professors across different fields at our university. Built a fully decentralized Flutter application that uses professors' own Google accounts for data storage, allowing easy access via Google Sheets and Excel export for reports. Focused on simplicity and minimalism to deliver exactly what professors needed most, ensuring reliable operation in environments with limited connectivity while maintaining data integrity.",
            "impact": "Revolutionized student record management workflows by reducing manual data entry by 50% and improving data accuracy by 30%. The system's innovative architecture received recognition for its elegant approach to solving complex data management challenges with minimal resources."
        },
        {
            "title": "Chirp",
            "role": "Frontend Engineer",
            "technologies": [
                "Flutter",
                "Firebase",
                "Real-time Data Synchronization",
                "Responsive UI Architecture"
            ],
            "description": "Engineered a social media application with a focus on performance optimization and responsive design. Implemented sophisticated state management and real-time data synchronization patterns to ensure a fluid user experience across various device capabilities and network conditions."
        },
        {
            "title": "Sara Kuch",
            "role": "Frontend Engineer & API Integration Specialist",
            "technologies": [
                "Flutter",
                "Firebase",
                "Shopify REST API",
                "Custom API Integration Layer"
            ],
            "description": "Designed and implemented an e-commerce application with a custom API integration layer that elegantly handles the complexities of the Shopify REST API. Engineered a resilient caching system and optimized data flow patterns to ensure exceptional performance and reliability even under challenging network conditions."
        }
    ],
    "publications": {
        "research_papers": [
            {
                "title": "Identification of Paddy Disease Along Its Processing Time",
                "authors": "Khan, S.N., Khan, S.U., Khan, M.A., Ansar, M.U., Shakeel, G.S., Ahmed, M., Zahid, N., & Ahmad, F.",
                "journal": "Quantum Journal of Social Sciences and Humanities, 4(3), 72-80",
                "link": "https://doi.org/10.55197/qjssh.v4i3.251",
                "description": "Developed an innovative image processing system for diagnosing paddy diseases. Achieved high accuracy rates using advanced image processing techniques."
            },
            {
                "title": "Paddy Leaf Disease Symptoms Detection Through Artificial Neural Network",
                "authors": "Khan, S.N., Khan, S.U., Ahmed, S., Khan, M.A., Khan, J.",
                "journal": "Quantum Journal of Engineering, Science and Technology, 4(4), 1-10",
                "link": "https://qjoest.com/index.php/qjoest/article/view/123/75",
                "description": "Co-authored a research paper on the detection of paddy leaf disease symptoms using artificial neural networks. Contributed to the development of a system that enhances the accuracy of disease detection in agricultural applications. Participated in experiments that demonstrated improved performance in symptom detection using ANN with high accuracy."
            }
        ],
        "cyber_security_articles": {
            "author_pseudonym": "H4ck3R_777",
            "platform": "Null Byte",
            "profile_link": "https://null-byte.wonderhowto.com/how-to/h4ck3r-777/",
            "articles": [
                {
                    "title": "Embed Metasploit Payload in Original APK Files",
                    "parts": [
                        "Part 1: Using TheFatRat",
                        "Part 2: Using Linder"
                    ]
                },
                {
                    "title": "Android Device Security Assessments with Termux on Android",
                    "parts": [
                        "Part 1: Over the Internet",
                        "Part 2: Over WLAN Hotspot"
                    ]
                },
                {
                    "title": "Installing Metasploit Framework on Android Devices",
                    "parts": [
                        "Part 1: In Termux",
                        "Part 2: In GNURoot-Debian",
                        "Part 3: In UserLAnd"
                    ]
                },
                {
                    "title": "Enhancing Password Cracking Efficiency",
                    "parts": [
                        "Use Multiple Threads/CPUs While Cracking Passwords with John the Ripper (Free Version)"
                    ]
                },
                {
                    "title": "File System Operations in Kali Linux",
                    "parts": [
                        "See How to Write to an NTFS Partition of HDD/SSD in Kali Linux"
                    ]
                },
                {
                    "title": "APK File Signing Techniques",
                    "parts": [
                        "Sign the APK File with Embedded Payload"
                    ]
                }
            ],
            "highlights": [
                "The article '*Android Device Security Assessments with Termux on Android: Part 1 - Over the Internet [Ultimate Guide]*' gained significant popularity from 2018 to 2020, becoming the second most-read article on Null Byte.",
                "Due to its widespread attention, the content was refined to focus only on technical details aimed at professionals in the field, ensuring responsible dissemination of information.",
                "The articles were crafted to educate readers on mobile security, ethical hacking practices, and the importance of securing Android devices against potential vulnerabilities."
            ]
        }
    },
    "research_collaborations": [
        {
            "title": "Quantum Computing and Photonics Simulation Research",
            "collaborator": "Visiting Professor (PhD)",
            "institution": "University of the Punjab, Jhelum Campus",
            "duration": "2023-2024",
            "description": "Collaborated with a visiting PhD professor on advanced research projects in quantum computing simulation and photonics. Developed specialized simulation tools in Python and MATLAB to model complex quantum phenomena and photon behavior in various experimental setups including mirror arrays, emitters, and detectors. This work supported research initiatives in Malaysia, contributing to the field of quantum optics and photonics."
        }
    ],
    "certifications_and_training": [
        "Modern C++ Mastery with Respect to Game Development by TheCherno (YouTube)",
        "Advanced Cryptography Course by Christof Paar (YouTube)",
        "Flutter Development Course by The App Brewery (Udemy)",
        ".NET Basic to Advanced by CodeWithMosh (Udemy) and Tim Corey (YouTube)",
        "IELTS Academic with British Council (details in Languages section)"
    ],
    "extracurricular_activities": [
        {
            "title": "Founder and Leader of International Cybersecurity Community",
            "description": "Initiated and led a vibrant online community of cybersecurity enthusiasts spanning multiple countries, including Iran, Pakistan, India, Australia, Finland, and Bangladesh. Started with just two members and grew to include 13 dedicated mentors from diverse backgrounds. The community fostered knowledge sharing, collaborative learning, and innovative approaches to security challenges over a 4-year period. Successfully recruited fellow students from my college and university, creating a thriving local interest in cybersecurity that extended beyond academic boundaries."
        },
        {
            "title": "Technical Mentor & Engineering Advocate",
            "description": "Served as an unofficial technical leader among peers, fostering a culture of engineering excellence and innovative problem-solving. Conducted specialized programming sessions focused on modern C++ techniques, system architecture, and performance optimization, helping fellow students develop a deeper understanding of software engineering principles."
        },
        {
            "title": "Open Source Engineering Contributions",
            "description": "Actively developing `mr_crypt`, an innovative cryptography library that reimagines how developers interact with cryptographic primitives. Contributing architectural improvements and performance optimizations to projects like `AvaloniaUI`, `Flutter`, and `fluent_ui`, focusing on elegant solutions to complex technical challenges."
        },
        {
            "title": "AI Engineering Integration Pioneer",
            "description": "Developing sophisticated approaches to integrate AI capabilities into the software engineering workflow. Created advanced prompt engineering techniques that enable AI systems to assist with complex architectural decisions, algorithm optimization, and system design challenges, establishing new paradigms for AI-assisted software development."
        },
        {
            "title": "ERP Architecture Consultant",
            "description": "Serving as a key architectural consultant for ACE Money Transfer's enterprise-grade ERP system. Providing strategic guidance on system architecture using an Entity-Attribute-Value model for exceptional flexibility, recommending technology choices like PrimeNG components that were widely adopted, and designing sophisticated approval workflows and administrative systems. Applying a 'simplicity-driven innovation' philosophy to create elegant solutions to complex enterprise challenges."
        }
    ],
    "languages": [
        {
            "language": "Urdu",
            "proficiency": "Native"
        },
        {
            "language": "English",
            "proficiency": "7.5 Bands in IELTS Academic",
            "details": {
                "listening": 8.5,
                "reading": 7.0,
                "writing": 7.0,
                "speaking": 7.0,
                "overall": 7.5
            }
        }
    ],
    "interests": [
        {
            "interest": "Engineering Novel Solutions",
            "description": "Passionate about creating what hasn't been built before and solving problems others consider impossible through innovative system design and creative engineering approaches"
        },
        {
            "interest": "Cyber Security & Ethical Hacking",
            "description": "Driven by a fascination with exploring the boundaries of software systems, identifying security vulnerabilities, and engineering robust protection mechanisms that exceed industry standards"
        },
        {
            "interest": "Artificial Intelligence as an Engineering Accelerator",
            "description": "Leveraging AI as a force multiplier for engineering and problem-solving, using advanced models to enhance ideation, brainstorming, and solution development processes"
        },
        {
            "interest": "Cryptography & Security Architecture",
            "description": "Designing and implementing sophisticated cryptographic systems and security architectures that balance theoretical security principles with practical implementation considerations"
        },
        {
            "interest": "Low-Level Systems Programming",
            "description": "Mastering modern C++ and system-level programming to build high-performance, optimized solutions for complex computing challenges"
        },
        {
            "interest": "Game Development & Engine Architecture",
            "description": "Exploring game development as both a lifelong passion and a technical challenge, with particular focus on performance optimization and engine architecture"
        },
        {
            "interest": "Algorithmic Optimization",
            "description": "Finding elegant, efficient solutions to complex computational problems through innovative algorithm design and optimization techniques"
        },
        {
            "interest": "Open Source Innovation",
            "description": "Contributing to and creating open-source projects that advance the state of the art in cryptography, security, and software development"
        },
        {
            "interest": "Advanced Information Retrieval",
            "description": "Developing sophisticated techniques for finding, synthesizing, and applying information from diverse sources to solve complex engineering challenges"
        },
        {
            "interest": "System Architecture Design",
            "description": "Designing extensible, scalable software architectures that anticipate future requirements and adapt elegantly to changing needs"
        },
        {
            "interest": "Balanced Engineering Approach",
            "description": "Maintaining harmony between technical excellence, user experience, and business requirements through thoughtful engineering decisions"
        }
    ],
    "references": "Available upon request."
}
